nakagawa_6MPa/cavitationModel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multiphaseEuler;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.00005;

writeControl    timeStep;

writeInterval   1; //100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.0001; // 0.001;

functions
{
    dmdt_gas
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("dmdt.gas");
   }
    dmdt_liquid
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("dmdt.liquid");
   }
    Tsat
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("thermalPhaseChange:Tsat.gas_liquid");
   }
    mu_gas
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("mu.gas");
   }
    mu_liquid
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("mu.liquid");
   }
    rho_gas
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("rho.gas");
   }
    rho_liquid
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("rho.liquid");
   }
    h_gas
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("h.gas");
   }
    h_liquid
   {
        type                  writeObjects;
        libs                  ("libutilityFunctionObjects.so");
        writeControl          writeTime;
        objects
        ("h.liquid");
   }
}
/*
functions
{
    writeWallBoilingProperties
    {
        type            wallBoilingProperties;
        libs            ( "libmultiphaseEulerFoamFunctionObjects.so" );
        writeControl    writeTime;
        phase           liquid;
    }
    outflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           outlet;
        operation       sum;
        fields          ( alphaRhoPhi.gas  alphaRhoPhi.liquid);
    }
    inflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           inlet;
        operation       sum;
        fields          ( alphaRhoPhi.gas alphaRhoPhi.liquid);
    }
    outletGas
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           outlet;
        operation       sum;
        weightField     alphaRhoPhi.gas;
        fields          ( h.gas );
    }
    outletLiquid
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           outlet;
        operation       sum;
        weightField     alphaRhoPhi.liquid;
        fields          ( h.liquid );
    }
    inletGas
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           inlet;
        operation       sum;
        weightField     alphaRhoPhi.gas;
        fields          ( h.gas );
    }
    inletLiquid
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        select          patch;
        patch           inlet;
        operation       sum;
        weightField     alphaRhoPhi.liquid;
        fields          ( h.liquid );
    }
    #includeFunc writeObjects(d.gas)
}
*/


// ************************************************************************* //
