nakagawa_6MPa/cavitationModel/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    thermalPhaseChangeMultiphaseSystem;

phases (gas liquid);

gas
{
    type            purePhaseModel;
    diameterModel   constant; //isothermal;
    d               1e-5;
    /*
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }
    */
    residualAlpha   1e-3;
}

liquid
{
    
    type            purePhaseModel;
    diameterModel   constant; //isothermal;
    d               1e-5;
    residualAlpha   1e-3;
    /*
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    residualAlpha   1e-3;
    */
    // diameterModel   none;
    
}

blending
{
     /*
    default
    {
        type            continuous;
        phase           liquid;
    }
    */
    
    default
    {
        type            linear;
        minPartlyContinuousAlpha.gas 0.3;
        minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.liquid 0.3;
        minFullyContinuousAlpha.liquid 0.7;
    }
    /*
    heatTransfer
    {
        type            linear;
        minPartlyContinuousAlpha.gas 0;
        minFullyContinuousAlpha.gas 1;
        minPartlyContinuousAlpha.liquid 0;
        minFullyContinuousAlpha.liquid 1;
    }
    */
}

saturationTemperature
{    
    gas_liquid
    {
        type function1;

        function scale;

        xScale 1e-6;
        scale   1;
        value
        {
            type                tableFile;
            format              csv;
            nHeaderLine         1;
            refColumn           1;
            componentColumns    (0);
            mergeSeparators     no;
            file "$FOAM_RUN/twoPhaseNozzles/nakagawa_6MPa/CarbonDioxide_590000_6500000_218.592_400_saturation.csv";
            //file "$FOAM_RUN/twoPhaseNozzles/nakagawa_6MPa/CarbonDioxide_517964_10000000_218.592_400_saturation.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           1e-5;
    }
}

drag
{
    gas_dispersedIn_liquid
    {
        type            SchillerNaumann; //IshiiZuber;
    }
    liquid_dispersedIn_gas
    {
        type            SchillerNaumann; //IshiiZuber;
    }
    
}

virtualMass
{
    /*
    gas_dispersedIn_liquid
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
    */
}

heatTransfer
{   
    /*
    gas_dispersedIn_liquid
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
    liquid_dispersedIn_gas
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
    */
    gas_dispersedIn_liquid_inThe_gas
    {
        type spherical;
        residualAlpha   1e-4;
    }
    gas_dispersedIn_liquid_inThe_liquid
    {
        type RanzMarshall;
        residualAlpha   1e-4;
    }
    liquid_dispersedIn_gas_inThe_gas
    {
        type RanzMarshall;
        residualAlpha   1e-4;
    }
    liquid_dispersedIn_gas_inThe_liquid
    {
        type spherical;
        residualAlpha   1e-4;
    }
}

lift
{
    /*
    gas_dispersedIn_liquid
    {
        type wallDamped;

        lift
        {
            type Tomiyama;
            Cl 0.288;

            aspectRatio
            {
                type constant;
                E0 1;
            }
        }

        wallDamping
        {
            type    cosine;
            Cd      1.0;
            zeroWallDist 0.0002;
        }
    }
    */
}

wallLubrication
{
    /*
    gas_dispersedIn_liquid
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
    */
}

turbulentDispersion
{
    /*
    gas_dispersedIn_liquid
    {
        type                LopezDeBertodano;
        Ctd                 1.0;
        residualAlpha       1e-3;
    }
    */
}

phaseTransfer
{
    /*
    gas_dispersedIn_liquid
    {
        type        cavitation;

        model       SchnerrSauer;

        liquid      liquid;

        pSat        80000;

        UInf        5.33;
        tInf        0.028142589;
        Cc          100;
        Cv          100;
    }
    */
}

// ************************************************************************* //
